{
  "backend/main.mo": "Main Motoko actor implementing user profiles, block reports, work histories, legal defenses, admin actions, and gallery images with role-based access control (admin/user permissions) and blocked-user checks.",
  "feature_evidence.json": "Feature evidence report documenting the logo size increase in the header navigation (Layout.tsx) with high confidence and associated test ID REQ-1.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, hooks, components, pages, utilities, and PWA configuration with focus on admin features, authentication, and the updated orange shield logo branding.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH dark color system, custom CSS variables for light/dark themes, and base styling for background and foreground colors.",
  "frontend/index.html": "HTML entry point with PWA meta tags, iOS-specific configuration, theme color (#ea580c), and references to generated icon assets for ROTAS & DIREITOS app.",
  "frontend/public/manifest.json": "PWA manifest defining app name \"ROTAS & DIREITOS\", standalone display mode, orange theme color, and icon references for 192x192 and 512x512 sizes.",
  "frontend/public/offline.html": "Static offline fallback page with Portuguese messaging, styled with gradient background and retry button for when the app has no internet connection.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets, network-first for API calls, offline fallback, and cache management excluding Internet Identity domains.",
  "frontend/src/App.tsx": "Root React component with TanStack Router setup, authentication flow, profile setup modal, admin route guards, and routes for dashboard, calculator, defense, drafts, pricing, and admin pages.",
  "frontend/src/components/AdminMenu.tsx": "Dropdown menu component for admin navigation that displays links to dashboard, users, and activity pages; only visible to authenticated admin users.",
  "frontend/src/components/AdminRouteGuard.tsx": "Route guard component that checks admin permissions and displays loading state, access denied message, or renders children based on authentication status.",
  "frontend/src/components/BlockReportForm.tsx": "Form component for submitting block reports with fields for platform, driver details, CPF, phone, block date, and reason; includes validation for CPF and phone formats.",
  "frontend/src/components/BlockUserDialog.tsx": "Dialog component for blocking users with optional reason input; handles block mutation and displays loading/success states.",
  "frontend/src/components/CalculationHistory.tsx": "Empty file with no content.",
  "frontend/src/components/CalculationReview.tsx": "Review component that displays formatted block report, work history, and ceased profits data with edit and confirm actions before generating legal defense.",
  "frontend/src/components/DefenseDocument.tsx": "Empty file with no content.",
  "frontend/src/components/DefenseEditor.tsx": "Text editor component for reviewing and editing generated legal defense documents with character count, reset functionality, and save action.",
  "frontend/src/components/DefenseHistory.tsx": "Empty file with no content.",
  "frontend/src/components/DraftIndicator.tsx": "Floating indicator component that displays auto-save status with time-ago formatting and auto-hides after 5 seconds.",
  "frontend/src/components/ExportSuccessModal.tsx": "Success modal dialog shown after PDF export with next steps guidance and navigation options to create new report or return to dashboard.",
  "frontend/src/components/FinancialCalculator.tsx": "Empty file with no content.",
  "frontend/src/components/InstallPrompt.tsx": "Displays a dismissible prompt for installing the PWA using the beforeinstallprompt event, storing dismissal state in localStorage.",
  "frontend/src/components/Layout.tsx": "Main layout component with header navigation, logo, authentication-aware menu links, and conditional rendering for unauthenticated or blocked users.",
  "frontend/src/components/LegalDefenseGenerator.tsx": "Form component for selecting block type and providing context to generate a legal defense document using block report, work history, and ceased profits data.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity login/logout and clears the query cache on logout.",
  "frontend/src/components/NavigationButtons.tsx": "Reusable navigation buttons component with back/next actions, loading states, and customizable labels.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog for first-time user profile setup with name and email validation, preventing dismissal until completed.",
  "frontend/src/components/ProgressIndicator.tsx": "Visual progress bar showing current step out of total steps with customizable step labels.",
  "frontend/src/components/Tooltip.tsx": "Wrapper component for displaying tooltips with help icon trigger and customizable content and positioning.",
  "frontend/src/components/UnblockUserDialog.tsx": "Confirmation dialog for unblocking a user by principal, with loading state and success/error toast notifications.",
  "frontend/src/components/WorkHistoryForm.tsx": "React form component for collecting driver work history data including active months, earnings, and monthly expenses (vehicle, insurance, fuel, maintenance). Calculates ceased profits based on blocked days and displays real-time loss calculations.",
  "frontend/src/constants/translations.ts": "Portuguese translation constants for the entire application, including form labels, placeholders, button text, section headings, error/success messages, and help tooltips.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using Internet Identity authentication. Creates authenticated or anonymous actors and initializes access control with admin token from URL parameters.",
  "frontend/src/hooks/useDraftPersistence.ts": "React hook for managing draft persistence in localStorage, providing functions to save, load, delete, and retrieve all drafts of block reports with their associated work history, ceased profits, and legal defense data.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login state, identity persistence, and providing login/logout functionality with configurable AuthClient options.",
  "frontend/src/hooks/useLocalStorage.ts": "React hook and utility functions for type-safe localStorage operations, providing state synchronization with localStorage and error handling for get, set, and remove operations.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for all backend API calls including user profile management, admin operations (user blocking, dashboard stats, activity logs), and block report CRUD operations with automatic cache invalidation.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for theming (colors, spacing, charts) in both light and dark modes. Includes logo animations, iOS PWA safe area support, and touch-friendly styling.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with QueryClient and InternetIdentityProvider wrappers for state management and authentication.",
  "frontend/src/pages/AdminActivityLogPage.tsx": "Admin page displaying a filterable table of admin actions (block/unblock users) with timestamps, action types, and target users. Uses React Query hooks to fetch activity log data.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard showing statistics cards for total, active, and blocked users, plus a list of recent user registrations. Fetches data via useGetAdminDashboardStats hook.",
  "frontend/src/pages/AdminUserManagementPage.tsx": "Admin page for managing users with search functionality and a table displaying user profiles. Includes dialogs for blocking and unblocking users with actions triggered via button clicks.",
  "frontend/src/pages/CalculatorPage.tsx": "Multi-step calculator page for ceased profits calculation with draft persistence. Manages block reports, work history, profit calculations, and legal defense generation through a 5-step wizard with auto-save functionality.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page displaying welcome hero section, statistics cards (total calculations, defenses, and loss amounts), and quick action cards for navigating to calculator and legal defense features.",
  "frontend/src/pages/DraftsHistoryPage.tsx": "Page for viewing and managing saved drafts with functionality to load, delete individual drafts, or clear all drafts, displaying draft progress and timestamps.",
  "frontend/src/pages/LegalDefensePage.tsx": "Simple page that redirects users to the calculator flow to generate legal defense documents, displaying an informational card with a call-to-action button.",
  "frontend/src/pages/PricingPage.tsx": "Pricing page displaying three subscription tiers (basic, premium, professional) with features and PIX payment key copy functionality for Brazilian payments.",
  "frontend/src/utils/currencyFormat.ts": "Utility functions for Brazilian currency formatting, parsing, and validation including CPF and phone number formatting and validation.",
  "frontend/src/utils/pdfExport.ts": "PDF export utility that creates print-friendly HTML windows with styled content for block reports, work history, ceased profits calculations, and legal defense documents.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, typography, container queries, animations, and custom font families.",
  "project_state.json": "Project metadata tracking one existing feature to increase logo size in header navigation for better visual harmony."
}