{
  "backend/main.mo": "Main actor implementing user profiles, admin controls (block/unblock users), dashboard data (block reports, work histories, ceased profits, legal defenses), gallery images, admin activity logging, and access control with blocked user checks.",
  "backend/migration.mo": "Migration module that transforms old UserProfile records (name, email) to new UserProfile records by adding registrationDate and isBlocked fields with default values.",
  "feature_evidence.json": "Feature evidence report documenting implemented admin features including admin menu navigation, user data management page, block/unblock functionality, admin dashboard statistics, and admin activity logging with associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including admin routes, admin-specific React Query hooks, admin components (AdminMenu, BlockUserDialog, UnblockUserDialog), admin pages (AdminDashboardPage, AdminUserManagementPage, AdminActivityLogPage), and existing user-facing features.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables including background, foreground, card, primary, secondary, muted, accent, destructive, border, input, ring, chart, and sidebar colors.",
  "frontend/index.html": "HTML entry point with Portuguese language, PWA manifest link, iOS meta tags, theme color, app icons referencing rotas-direitos branding assets, and viewport configuration with safe-area support.",
  "frontend/public/manifest.json": "PWA manifest defining app name \"ROTAS & DIREITOS\", standalone display mode, orange theme color, portrait orientation, and icon references to rotas-direitos branding assets at 192x192 and 512x512 sizes.",
  "frontend/public/offline.html": "Standalone offline fallback page with Portuguese text, gradient dark background, offline icon, connection error message, and retry button styled to match app theme.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets, network-first for API calls, offline fallback for navigation, cache cleanup on activation, and exclusions for Internet Identity and IC domains.",
  "frontend/src/App.tsx": "Main application entry point that sets up React Router with TanStack Router, React Query client, and defines all routes (dashboard, calculator, legal defense, drafts, admin pages). Includes authentication checks, profile setup modal, and admin route guards.",
  "frontend/src/components/AdminMenu.tsx": "Dropdown menu component for admin navigation that displays links to admin dashboard, user management, and activity log pages. Only visible to users with admin privileges.",
  "frontend/src/components/AdminRouteGuard.tsx": "Route guard component that checks if the current user is an admin and displays an access denied message with a home button if not authorized. Shows loading spinner while checking permissions.",
  "frontend/src/components/BlockReportForm.tsx": "Form component for collecting block report information including platform, block reason, driver details (name, CPF, phone), block date, and additional context. Includes validation for CPF and phone number formats.",
  "frontend/src/components/BlockUserDialog.tsx": "Dialog component for blocking a user with an optional reason field. Uses the useBlockUser mutation hook and displays success/error toasts.",
  "frontend/src/components/CalculationHistory.tsx": "Empty file (no content provided).",
  "frontend/src/components/CalculationReview.tsx": "Review component that displays a summary of block report, work history, and ceased profits data before generating legal defense. Includes edit and confirm actions with formatted dates, currency, and time periods.",
  "frontend/src/components/DefenseDocument.tsx": "Empty file (no content provided).",
  "frontend/src/components/DefenseEditor.tsx": "Text editor component for reviewing and editing generated legal defense documents. Features character count, reset to original functionality with confirmation dialog, and save capability.",
  "frontend/src/components/DefenseHistory.tsx": "Empty file (no content provided).",
  "frontend/src/components/DraftIndicator.tsx": "Floating indicator component that shows when a draft was last saved with relative time display (e.g., 'há 2 minutos'). Auto-hides after 5 seconds and updates time display every 30 seconds.",
  "frontend/src/components/ExportSuccessModal.tsx": "A modal dialog that displays a success message after PDF export, showing next steps and offering buttons to create a new report, return to dashboard, or close the modal.",
  "frontend/src/components/FinancialCalculator.tsx": "Empty file with no content.",
  "frontend/src/components/InstallPrompt.tsx": "A PWA install prompt component that listens for the beforeinstallprompt event and displays a dismissible banner encouraging users to install the app, with state persisted in localStorage.",
  "frontend/src/components/Layout.tsx": "Main layout component providing header with logo, navigation menu (dashboard, calculator, legal defense, admin), authentication state handling, and displays blocked user alerts or login prompts based on user status.",
  "frontend/src/components/LegalDefenseGenerator.tsx": "Form component for generating legal defense documents by selecting a block type (arbitrary dismissal, false accusation, etc.) and providing additional context, then calling the AI generation mutation with compiled case data.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout, manages loading states, and clears the query cache on logout.",
  "frontend/src/components/NavigationButtons.tsx": "Reusable navigation button pair (back/next) with configurable labels, visibility, disabled states, and loading indicators for multi-step forms.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog for first-time user profile setup requiring name and email with validation, preventing dismissal until profile is saved.",
  "frontend/src/components/ProgressIndicator.tsx": "Visual progress bar component showing current step out of total steps with labeled stages (block report, work history, review, defense, edit) for multi-step workflows.",
  "frontend/src/components/Tooltip.tsx": "Wrapper component for displaying tooltips with help icon trigger and customizable content and positioning using Radix UI primitives.",
  "frontend/src/components/UnblockUserDialog.tsx": "Confirmation dialog for admin users to unblock a blocked user, displaying the user's name and calling the unblock mutation with loading state handling.",
  "frontend/src/components/WorkHistoryForm.tsx": "React form component for collecting driver work history data including active months, earnings, and monthly expenses (vehicle financing, insurance, fuel, maintenance). Calculates ceased profits based on blocked days and displays real-time loss calculations.",
  "frontend/src/constants/translations.ts": "Portuguese translations object containing all UI text for labels, placeholders, buttons, headings, error messages, success messages, and help tooltips used throughout the application.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializes access control with admin token from URL params, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useDraftPersistence.ts": "Custom hook for managing draft persistence in localStorage, providing functions to save, load, delete, and retrieve all drafts containing block reports, work history, ceased profits, legal defense text, and current step.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login state, identity persistence, and providing login/logout functionality with configurable AuthClient options.",
  "frontend/src/hooks/useLocalStorage.ts": "Custom React hook and utility functions for managing localStorage with JSON serialization, providing stateful storage with error handling for get, set, and remove operations.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for all backend API calls including user profile management, admin operations (user blocking, dashboard stats, activity logs), and block report CRUD operations with automatic cache invalidation.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for theming (colors, spacing, charts) with dark mode support, iOS PWA safe area handling, touch-friendly sizing, and responsive mobile optimizations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminActivityLogPage.tsx": "Admin page displaying a filterable table of admin actions (block/unblock users) with timestamps, action types, and target users, sorted by most recent first.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard showing statistics cards for total, active, and blocked users, plus a list of recent user registrations with timestamps.",
  "frontend/src/pages/AdminUserManagementPage.tsx": "Admin page for managing users with search functionality, displaying a table of all users with their status, and providing block/unblock actions via dialogs.",
  "frontend/src/pages/CalculatorPage.tsx": "Multi-step calculator page that guides users through block report entry, work history, profit calculation, legal defense generation, and PDF export with draft auto-save functionality.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page component displaying welcome hero section, statistics cards (total calculations, defenses, and loss amounts), and quick action cards for navigating to calculator and legal defense features.",
  "frontend/src/pages/DraftsHistoryPage.tsx": "Page for viewing and managing saved draft calculations, allowing users to load, delete individual drafts, or clear all drafts with confirmation dialogs.",
  "frontend/src/pages/LegalDefensePage.tsx": "Simple page that redirects users to the calculator flow, explaining that legal defense generation requires completing the full block report workflow.",
  "frontend/src/utils/currencyFormat.ts": "Utility functions for Brazilian currency formatting, parsing, and validation including CPF and phone number formatting with validation logic.",
  "frontend/src/utils/pdfExport.ts": "PDF export utility that creates print-friendly HTML windows with styled content for block reports, work history, ceased profits calculations, and legal defense documents.",
  "frontend/src/utils/urlParams.ts": "URL parameter management utilities supporting both hash-based and browser routing, with sessionStorage persistence for maintaining state like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme settings, container queries, typography plugin, and custom animations for accordion components.",
  "project_state.json": "Project state file for an admin panel application tracking 7 completed features (admin menu, user management, block/unblock functionality, dashboard statistics, activity logs, and route protection) and 2 pending feature requests for completing the admin menu and implementing backend authorization."
}