{
  "backend/main.mo": "Main actor implementing user profiles, block reports, work histories, ceased profits calculations, legal defenses, and gallery images with access control and blob storage mixins. Includes CRUD operations for all data types with authorization checks.",
  "backend/migration.mo": "Migration module that transforms old actor state (with trip data and financial breakdowns) to new actor state (with block reports, work histories, and ceased profits), preserving user profiles and gallery images while migrating legal defenses.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: block report form, work history section with ceased profits calculation, calculation review screen, and enhanced legal defense generator with block type selection.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including React components, hooks, pages, utilities, and configuration files for the Driver Defense Hub PWA application.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for a warm, driver-optimized design palette with custom properties for UI components.",
  "frontend/index.html": "HTML entry point with PWA manifest, iOS-specific meta tags for standalone mode, theme color configuration, and icon references for the Driver Defense Hub application.",
  "frontend/public/manifest.json": "PWA manifest defining Driver Defense Hub app metadata, standalone display mode, warm amber theme color, and icon configurations for 192x192 and 512x512 sizes.",
  "frontend/public/offline.html": "Standalone offline fallback page with Driver Defense Hub branding, warm color palette matching app theme, and retry functionality for when the app is accessed without internet connection.",
  "frontend/public/service-worker.js": "Service worker implementing caching strategies for offline support: cache-first for static assets, network-first for API calls, and offline fallback for navigation. Excludes Internet Identity and IC domains from caching.",
  "frontend/src/App.tsx": "Main application component using TanStack Router to define routes (dashboard, calculator, legal defense, drafts) and conditionally displays ProfileSetup modal if authenticated user has no profile.",
  "frontend/src/components/BlockReportForm.tsx": "Form component for collecting block report details (platform, reason, driver info, CPF, phone, date) with validation and formatting utilities for CPF and phone numbers.",
  "frontend/src/components/CalculationHistory.tsx": "Empty file with no content.",
  "frontend/src/components/CalculationReview.tsx": "Review component displaying block report, work history, and ceased profits data in a formatted layout with edit and confirm actions before generating legal defense.",
  "frontend/src/components/DefenseDocument.tsx": "Empty file with no content.",
  "frontend/src/components/DefenseEditor.tsx": "Textarea-based editor for reviewing and modifying generated legal defense text with character count, reset to original, and save functionality.",
  "frontend/src/components/DefenseHistory.tsx": "Empty file with no content.",
  "frontend/src/components/DraftIndicator.tsx": "Floating indicator showing auto-save status with relative time display (e.g., 'saved 2 minutes ago'), appears temporarily after each save.",
  "frontend/src/components/ExportSuccessModal.tsx": "Success modal displayed after PDF export with next steps guidance and action buttons for creating new report, returning to dashboard, or closing.",
  "frontend/src/components/FinancialCalculator.tsx": "Empty file with no content.",
  "frontend/src/components/InstallPrompt.tsx": "A React component that displays a dismissible alert prompting users to install the PWA to their home screen, using the beforeinstallprompt event and storing dismissal state in localStorage.",
  "frontend/src/components/Layout.tsx": "Main layout component with header, footer, and authentication-gated content area that displays the InstallPrompt and children when authenticated, or a welcome message with login prompt when not.",
  "frontend/src/components/LegalDefenseGenerator.tsx": "Form component for generating legal defense documents by selecting a block type (arbitrary dismissal, false accusation, etc.) and providing additional context, using block report, work history, and ceased profits data.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states and clears the query cache on logout.",
  "frontend/src/components/NavigationButtons.tsx": "Reusable navigation button pair component with customizable back/next labels, visibility, disabled states, and loading indicators.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog component for first-time user profile setup, collecting name and email with a non-dismissible dialog that saves to the backend.",
  "frontend/src/components/ProgressIndicator.tsx": "Visual progress bar component showing current step out of total steps with labeled milestones for multi-step forms (block report, work history, review, defense, edit).",
  "frontend/src/components/Tooltip.tsx": "Wrapper component around shadcn/ui tooltip primitives that displays help text on hover, defaulting to a HelpCircle icon trigger.",
  "frontend/src/components/WorkHistoryForm.tsx": "Form component for collecting driver work history including active time, earnings, and monthly expenses (vehicle financing, insurance, fuel, maintenance), with automatic calculation of ceased profits based on blocked days since the block date.",
  "frontend/src/constants/translations.ts": "Exports a TRANSLATIONS object containing Portuguese text for form labels, placeholders, buttons, headings, error/success messages, help text, and tooltips used throughout the driver defense application.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDraftPersistence.ts": "Custom hook providing localStorage-based persistence for draft block reports, including save, load, delete, and list operations with timestamp tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useLocalStorage.ts": "Custom React hook and utility functions for managing typed localStorage values with error handling, including get, set, and remove operations.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for managing user profiles, block reports, work histories, ceased profits calculations, legal defense generation, and dashboard data via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for dark theme colors, iOS PWA safe area support, touch-friendly sizing (44px minimum), and responsive mobile optimizations.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped with QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/src/pages/CalculatorPage.tsx": "Main calculator page component that manages a 5-step workflow for block reports, work history, profit calculations, legal defense generation, and PDF export. Includes draft persistence with auto-save functionality and uses React Query mutations for API interactions.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard landing page displaying overview statistics (ceased profits, defenses generated), recent defenses, and quick access cards for continuing drafts or starting new block reports. Fetches dashboard data via useGetDashboard hook.",
  "frontend/src/pages/DraftsHistoryPage.tsx": "Page for viewing, loading, and deleting saved drafts with confirmation dialogs. Displays draft list with timestamps and progress indicators, allowing users to resume incomplete workflows.",
  "frontend/src/pages/LegalDefensePage.tsx": "Simple placeholder page that redirects users to the calculator flow, indicating that legal defense generation requires completing the full block report workflow.",
  "frontend/src/utils/currencyFormat.ts": "Utility functions for Brazilian currency formatting (BRL), CPF/phone number formatting and validation, and parsing currency input strings to numbers.",
  "frontend/src/utils/pdfExport.ts": "PDF export utility that generates print-ready HTML documents with professional styling for legal defense documents, including block reports, work history, profit calculations, and formatted legal text.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear sensitive parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, dark mode support, custom animations, typography and container query plugins, and Inter/JetBrains Mono font families.",
  "project_state.json": "Project state document describing a PWA for blocked app drivers (Uber, 99, iFood, etc.) that calculates financial losses and generates AI-powered legal defenses with PDF export, featuring dark mode, mobile-first design, and no login requirement in MVP."
}