{
  "backend/main.mo": "Main Motoko actor defining user profiles, admin actions, block reports, work histories, legal defenses, and gallery images with authorization mixins and blob storage integration. Implements CRUD operations for user data, admin dashboard stats, activity logging, and user blocking/unblocking functionality.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: pricing plans page with subscription tiers, static PIX QR code display, and payment instructions section. All features have high confidence and reference frontend files and components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including React components, pages, hooks, utilities, and configuration. Describes routing, admin features, authentication, financial calculator, legal defense generator, PWA setup, and styling with orange branding.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables including background, foreground, primary, secondary, accent, and sidebar colors. Uses CSS custom properties for consistent theming across the application.",
  "frontend/index.html": "Main HTML entry point with PWA meta tags, iOS-specific configuration, theme color set to orange (#ea580c), and references to generated app icons. Includes viewport-fit for safe areas and Portuguese language declaration.",
  "frontend/public/manifest.json": "PWA manifest defining app name 'ROTAS & DIREITOS', standalone display mode, orange theme color, portrait orientation, and icon references for 192x192 and 512x512 sizes with maskable purpose.",
  "frontend/public/offline.html": "Offline fallback page with Portuguese messaging explaining no internet connection, styled with dark gradient background and orange accent color, includes retry button to reload the application.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets, network-first for API calls, excludes Internet Identity domains from caching, and provides offline fallback for navigation requests with cache management.",
  "frontend/src/App.tsx": "Main application entry point that sets up React Query, TanStack Router with routes for dashboard, calculator, legal defense, drafts, pricing, and admin pages, and handles authentication state with Internet Identity and profile setup flow.",
  "frontend/src/components/AdminMenu.tsx": "Dropdown menu component that displays admin navigation links (dashboard, users, activity) only for users with admin privileges, using Shield icon and highlighting active admin routes.",
  "frontend/src/components/AdminRouteGuard.tsx": "Route guard component that checks if the current user is an admin and displays an access denied message with a home button if unauthorized, or renders children if authorized.",
  "frontend/src/components/BlockReportForm.tsx": "Form component for collecting block report information including platform, block reason, driver details (name, CPF, phone), block date, and additional context with validation for CPF and phone formats.",
  "frontend/src/components/BlockUserDialog.tsx": "Dialog component for blocking a user with an optional reason field, using the useBlockUser mutation hook and displaying success/error toasts.",
  "frontend/src/components/CalculationHistory.tsx": "Empty component file with no content.",
  "frontend/src/components/CalculationReview.tsx": "Review component that displays formatted block report, work history, and ceased profits data with edit and confirm actions, including date formatting and expense calculations.",
  "frontend/src/components/DefenseDocument.tsx": "Empty component file with no content.",
  "frontend/src/components/DefenseEditor.tsx": "Text editor component for reviewing and editing legal defense documents with character count, reset to original functionality via confirmation dialog, and save capability.",
  "frontend/src/components/DefenseHistory.tsx": "Empty component file with no content.",
  "frontend/src/components/DraftIndicator.tsx": "Displays a temporary toast notification showing when a draft was last saved, with time-ago formatting in Portuguese and auto-hide after 5 seconds.",
  "frontend/src/components/ExportSuccessModal.tsx": "Modal dialog shown after successful PDF export, displaying success message with next steps and action buttons for creating new reports or returning to dashboard.",
  "frontend/src/components/FinancialCalculator.tsx": "Empty file with no content.",
  "frontend/src/components/InstallPrompt.tsx": "PWA install prompt component that listens for beforeinstallprompt event and shows a dismissible banner encouraging users to install the app.",
  "frontend/src/components/Layout.tsx": "Main application layout with header navigation, logo, authentication-gated menu items, and conditional rendering for unauthenticated or blocked users.",
  "frontend/src/components/LegalDefenseGenerator.tsx": "Form component for generating legal defense documents by selecting block type and providing additional context, using block report, work history, and ceased profits data.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that handles Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/NavigationButtons.tsx": "Reusable back/next navigation buttons with customizable labels, loading states, and disabled states for multi-step forms.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog for first-time user profile setup requiring name and email with validation, non-dismissible until completed.",
  "frontend/src/components/ProgressIndicator.tsx": "Visual progress bar showing current step in multi-step process with step labels and completion status.",
  "frontend/src/components/Tooltip.tsx": "Wrapper component for displaying help tooltips with customizable content and positioning, defaulting to a help circle icon trigger.",
  "frontend/src/components/UnblockUserDialog.tsx": "Dialog component for unblocking users with confirmation UI, using a mutation hook to call the unblock API and displaying toast notifications on success or error.",
  "frontend/src/components/WorkHistoryForm.tsx": "Form component for collecting driver work history (active months, earnings, expenses) and automatically calculating ceased profits based on block duration and daily expenses.",
  "frontend/src/constants/translations.ts": "Centralized Portuguese translations for labels, placeholders, buttons, headings, error messages, success messages, and help text used throughout the application.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDraftPersistence.ts": "Hook for managing draft persistence in localStorage, providing functions to save, load, delete, and retrieve all drafts with timestamps for multi-step form workflows.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useLocalStorage.ts": "Custom hook and utility functions for type-safe localStorage operations with JSON serialization, error handling, and React state synchronization.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile management, admin operations (user blocking/unblocking, dashboard stats, activity logs), and block report management using TanStack Query and the actor pattern.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for dark theme, logo animations (float/glow), iOS PWA safe area support, and touch-friendly styling for standalone mode.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminActivityLogPage.tsx": "Admin page displaying a filterable table of admin actions (block/unblock users) with timestamps, action types, and target users, sorted by most recent first.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard showing statistics cards for total/active/blocked users and a list of recent user registrations with timestamps.",
  "frontend/src/pages/AdminUserManagementPage.tsx": "Admin page with searchable user table displaying user profiles, registration dates, and status with block/unblock action buttons triggering confirmation dialogs.",
  "frontend/src/pages/CalculatorPage.tsx": "Main multi-step calculator page that guides users through block report, work history, ceased profits calculation, legal defense generation, and PDF export. Includes draft auto-save/restore functionality and progress tracking across 5 steps.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard landing page displaying statistics (total calculations, defenses, losses) and quick action cards for starting new calculations or generating legal defenses. Fetches data via useGetDashboard hook.",
  "frontend/src/pages/DraftsHistoryPage.tsx": "Page for viewing, loading, and deleting saved draft calculations. Lists all drafts with timestamps and progress indicators, with options to delete individual drafts or clear all.",
  "frontend/src/pages/LegalDefensePage.tsx": "Simple placeholder page that redirects users to the calculator flow to generate legal defenses, as standalone defense generation is not supported.",
  "frontend/src/pages/PricingPage.tsx": "Pricing page displaying three subscription tiers (Basic, Premium, Professional) with features and PIX payment integration including copy-to-clipboard functionality for the PIX key.",
  "frontend/src/utils/currencyFormat.ts": "Utility functions for Brazilian currency, CPF, and phone number formatting and validation, including parsers for currency input and validators for CPF check digits.",
  "frontend/src/utils/pdfExport.ts": "Exports block reports to PDF by opening a print window with formatted HTML content including headers, tables, calculations, and legal text sections with professional styling.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH, typography, animations, and design tokens for a consistent UI theme with dark mode support.",
  "project_state.json": "Project state tracking document for a mobile app with pricing plans, static PIX QR code payment, and navigation features; notes manual payment verification and platform limitations."
}