{
  "backend/main.mo": "Main Motoko actor implementing user profiles, block reports, work histories, ceased profits calculations, legal defenses, and gallery images with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting three localization features: translating frontend UI components to Portuguese, updating PWA manifest metadata, and localizing the offline fallback page.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including React components, pages, hooks, utilities, and configuration files with emphasis on Portuguese translations and PWA functionality.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for background, foreground, primary, secondary, accent, and chart colors.",
  "frontend/index.html": "HTML entry point with Portuguese lang attribute, PWA meta tags, iOS-specific configuration, and references to app icons and manifest.",
  "frontend/public/manifest.json": "PWA manifest defining app name, short name, description, icons, and display properties all in Brazilian Portuguese with orange theme color.",
  "frontend/public/offline.html": "Standalone offline fallback page with Portuguese heading, description, and retry button styled with dark gradient background and orange accent.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets, network-first for API calls, offline fallback, and cache cleanup while excluding Internet Identity domains.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, authentication flow, profile setup modal, and route definitions for dashboard, calculator, defense, and drafts pages.",
  "frontend/src/components/BlockReportForm.tsx": "Form component for collecting block report information including platform, driver details (name, CPF, phone), block date and reason, with validation and formatting utilities.",
  "frontend/src/components/CalculationHistory.tsx": "Empty file with no content.",
  "frontend/src/components/CalculationReview.tsx": "Review component displaying block report, work history, and ceased profits data in a formatted card layout with edit and confirm actions.",
  "frontend/src/components/DefenseDocument.tsx": "Empty file with no content.",
  "frontend/src/components/DefenseEditor.tsx": "Text editor component for reviewing and modifying generated legal defense documents with character count, reset functionality, and save confirmation.",
  "frontend/src/components/DefenseHistory.tsx": "Empty file with no content.",
  "frontend/src/components/DraftIndicator.tsx": "Floating indicator component that displays auto-save status with time-ago formatting, appearing temporarily after saves.",
  "frontend/src/components/ExportSuccessModal.tsx": "Success modal dialog shown after PDF export with next steps guidance and navigation options to create new report or return to dashboard.",
  "frontend/src/components/FinancialCalculator.tsx": "Empty file with no content.",
  "frontend/src/components/InstallPrompt.tsx": "PWA install prompt component that listens for beforeinstallprompt event and displays dismissible banner encouraging app installation.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper with header navigation, authentication-aware routing, login button, and footer; shows login prompt for unauthenticated users.",
  "frontend/src/components/LegalDefenseGenerator.tsx": "React component that allows users to select a block type (arbitrary dismissal, false accusation, system error, discrimination, retaliation) and provide additional context to generate a personalized legal defense document using AI, integrating block report, work history, and ceased profits data.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout, manages authentication state, and clears the query cache on logout.",
  "frontend/src/components/NavigationButtons.tsx": "Reusable navigation component that renders back and next buttons with customizable labels, loading states, and disabled states for multi-step forms.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog component for first-time user profile setup that collects and validates name and email, preventing dismissal until profile is saved.",
  "frontend/src/components/ProgressIndicator.tsx": "Visual progress bar component that displays current step out of total steps with labeled milestones for multi-step workflows (block report, work history, review, defense, edit).",
  "frontend/src/components/Tooltip.tsx": "Wrapper component around shadcn/ui tooltip primitives that displays help text with a HelpCircle icon trigger, supporting customizable positioning.",
  "frontend/src/components/WorkHistoryForm.tsx": "Form component that collects driver work history (active months, earnings, expenses) and automatically calculates ceased profits based on days blocked since the block date, with currency formatting utilities.",
  "frontend/src/constants/translations.ts": "Centralized Portuguese translations object containing all UI text including labels, placeholders, buttons, headings, error messages, success messages, and help tooltips used throughout the application.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, automatically invalidating dependent queries when identity changes and initializing access control with admin token from URL parameters.",
  "frontend/src/hooks/useDraftPersistence.ts": "Custom React hook for managing draft persistence in localStorage, providing functions to save, load, delete, and retrieve all drafts with automatic timestamp sorting.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication on ICP, managing login state, identity persistence, and providing authentication methods with configurable AuthClient options.",
  "frontend/src/hooks/useLocalStorage.ts": "Custom React hook and utility functions for managing localStorage with JSON serialization, error handling, and reactive state updates.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for managing backend data operations including user profiles, block reports, work histories, ceased profits calculations, legal defense generation, and dashboard data with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for dark theme, iOS PWA safe area support, touch-friendly sizing (44px minimum), and responsive mobile optimizations.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/CalculatorPage.tsx": "Multi-step calculator page component managing block reports, work history, ceased profits calculations, and legal defense generation with draft auto-save functionality and PDF export.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page component displaying welcome hero section, statistics cards (total calculations, defenses, and loss amounts), and quick action cards for navigating to calculator and legal defense features.",
  "frontend/src/pages/DraftsHistoryPage.tsx": "Page for viewing and managing saved draft calculations, allowing users to load, delete individual drafts, or clear all drafts with confirmation dialogs.",
  "frontend/src/pages/LegalDefensePage.tsx": "Placeholder page that redirects users to the calculator flow to generate legal defense documents, displaying an informational card with a call-to-action button.",
  "frontend/src/utils/currencyFormat.ts": "Utility functions for Brazilian currency formatting, parsing, and validation including CPF and phone number formatting with validation logic.",
  "frontend/src/utils/pdfExport.ts": "PDF export utility that creates print-friendly HTML windows with styled content for block reports, work history, ceased profits calculations, and legal defense documents.",
  "frontend/src/utils/urlParams.ts": "URL parameter management utilities supporting both hash-based and browser routing, with sessionStorage persistence for maintaining state like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings for borders/shadows/fonts, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking localization of a frontend app to Brazilian Portuguese, with three existing features covering UI text translation, PWA manifest updates, and offline page localization. Contains one pending feature request (AR-1) to change the app language to Portuguese (Brazil)."
}